export const infoMap = {
  total: [
    {
      label: '总管理规模',
      value: 'SUM(产品总资产)',
    },
    {
      label: '总资产/总规模',
      value:
        '当前资金余额 + 合计应收金额 + 股票资产 + 债券资产 + 基金资产 + 回购资产 + 权证资产  + 其他资产 + 应付债券资产 + 信用衍生品资产 + 期货资产  + 期权资产 + 应收证券资产  + 黄金资产 - 期权资产_义务(备兑)仓 + 国债冲抵保证金金额',
    },
  ],
  totalProductList: [
    {
      label: '单位净值',
      value: '净资产/总份额',
    },
  ],
  overviewStatic: [
    {
      label: '总资产/总规模',
      value:
        '当前资金余额 + 合计应收金额 + 股票资产 + 债券资产 + 基金资产 + 回购资产 + 权证资产  + 其他资产 + 应付债券资产 + 信用衍生品资产 + 期货资产  + 期权资产 + 应收证券资产  + 黄金资产 - 期权资产_义务(备兑)仓 + 国债冲抵保证金金额',
    },
    {
      label: '总负债',
      value:
        '短期借款 + 卖出回购金融资产款 + 应付赎回款 + 应付赎回费 + 应付管理人报酬 + 应付托管费 + 应付销售服务费 + 应付交易费 + 应付税费 + 应付利息 + 应付利润 + 其他应付款',
    },
  ],
  overviewBaseline: [
    {
      label: '单位净值',
      value: '净资产/总份额',
    },
    {
      label: '净资产/资产净值',
      value:
        '净资产 = 当前资金余额 - 合计应付金额 + 合计应收金额 + 股票资产 + 债券资产 + 基金资产 + 回购资产 + 权证资产  + 其他资产 + 信用衍生品资产 + 期货资产  + 期权资产  + 应收证券资产 - 应付证券资产  + 黄金资产 - 金融性负债资产',
    },
    {
      label: '最大回撤',
      value: '区间时间范围内，产品净值走到最低点时的收益率回撤幅度的最大值',
    },
  ],
  overviewInstAsset: [
    {
      label: '指令可用头寸',
      value:
        'T+0指令可用头寸 = 当前现金余额 - 冻结金额+ 解冻金额 + T+0指令占用 + MIN(T+1变化 + T+1指令占用,0)',
    },
    {
      label: '交易可用头寸',
      value: '当前现金余额 - 冻结金额 + 解冻金额 + MIN(T+1变化,0)',
    },
  ],
  overviewDetail: [
    {
      label: '波动率',
      value: '平方根(Σ((每日回报率 - 平均回报率)^2) / (交易日数 - 1))',
    },
    {
      label: '夏普比率',
      value: '(年化收益率 - 无风险利率) / 年化波动率',
    },
  ],
  assentInventory: [
    // 持仓中心
    {
      label: '持仓成本',
      value: 'Round(Round(库存金额/库存数量,N)*卖出数量,2)',
    },
    {
      label: '持仓市值',
      value: 'Round(持仓数量*证券公允价,2)',
    },
  ],
  variationOverview: [
    // 指令订单
    {
      label: '交收未到账金额',
      value: '已成交未交收的金额汇总',
    },
    {
      label: '交收失败金额',
      value: '已成交交收失败的金额汇总',
    },
    {
      label: '交易所金额',
      value: '当日交易所成交金额',
    },
    {
      label: '银行间金额',
      value: '当日银行间成交金额',
    },
    {
      label: '备付金金额',
      value: '当日备付金账户余额',
    },
  ],
  incomeStatic1: [
    {
      label: '总盈亏',
      value: '累计差价收入 + 累计利息收入 + 累计红利收入 + 累计公允价变动',
    },
    {
      label: '浮动盈亏',
      value: '当日持有证券因行情变动产生的浮动盈亏',
    },
    {
      label: '累计收益',
      value: '累计差价收入 + 累计利息收入 + 累计红利收入',
    },
  ],
  incomeStatic2: [
    {
      label: '当日盈亏',
      value: '当日差价收入 + 当日利息收入 + 当日红利收入 + 当日公允价变动',
    },
    {
      label: '浮动盈亏',
      value: '当日持有证券因行情变动产生的浮动盈亏',
    },
    {
      label: '差价收益',
      value: '区间时间范围内，通过股票买卖交易价格差异获得的收益',
    },
  ],
  incomeCompare: [
    {
      label: '单笔最大盈利',
      value: '区间时间范围内，单笔交易盈利最大的一笔金额',
    },
    {
      label: '单笔最大亏损',
      value: '区间时间范围内，单笔交易亏损最大的一笔金额',
    },
    {
      label: '最大日盈利',
      value: '区间时间范围内，单日盈利最大的一笔金额',
    },
    {
      label: '最大日亏损',
      value: '区间时间范围内，单日亏损最大的一笔金额',
    },
  ],
  momTurnoverRate: [
    {
      label: '产品换手率',
      value: '(卖出金额 + 买入金额）÷ 资产规模',
    },
  ],
  momOperate: [
    // mom阶段收益
    {
      label: '浮动盈亏/公允价变动',
      value: '当日持有证券因行情变动产生的浮动盈亏',
    },
    {
      label: '利息收入',
      value:
        '债券利息收入 + 回购利息收入 + 资产支持证券利息收入 +活期利息收入(活期账户、备付金账户、保证金账户)',
    },
  ],
  momRightStatic1: [
    {
      label: '总收益',
      value: 'SUM(已实现收益 + 公允价变动)',
    },
    {
      label: '浮动收益',
      value: '当日持有证券因行情变动产生的浮动盈亏',
    },
    {
      label: '累计收益',
      value: '累计差价收入 + 累计利息收入 + 累计红利收入',
    },
  ],
  momStatic2: [
    {
      label: '当日收益',
      value: '当日差价收入 + 当日利息收入 + 当日红利收入 + 当日公允价变动',
    },
    {
      label: '浮动收益',
      value: '当日持有证券因行情变动产生的浮动盈亏',
    },
    {
      label: '差价收入',
      value: '区间时间范围内，通过股票买卖交易价格差异获得的收益',
    },
  ],
};
